[
  {
    "title": "Impacting Lives",
    "alias": "beaver-hangout",
    "headline": "Sharing my experiences with high school students at Beaver Hangout",
    "timeline": "May 10 2024",
    "searchDescription": "I shared my experiences and encouraged high school students on the importance of pursuing their career paths.",
    "longDescription": "I joined the Beaver Hangout as the coordinator to share my experiences with the community. I talked about my journey in technology and how I've been able to impact lives through my work. I aslo took the opportunity to encourage high school students to network with others, learn from each others and to be open to new opportunities."
  },
  {
    "title": "Community Engagement",
    "alias": "elevate-oregon",
    "headline": "Participating in and engaging with students at Elevate Oregon",
    "timeline": "July 3 2024",
    "searchDescription": "I represented the future of technology in a fireside chat in industry leaders at Platform Calgay's Annual Meeting",
    "longDescription": "I was honored to be the recipient of the 2023-2024 Hackergal x RBCx Innovation Scholarship. As part of this award, I had the incredible opportunity to share my story with the Chief Product Officer, Vice President of Ventures Technology, and other executives at RBC. I’m deeply grateful for the conversations and advice I received about becoming a leader in the technology space—wisdom that I’ve been actively channeling into how I approach my work today."
  },
  {
    "title": "Photography",
    "alias": "photography",
    "headline": "Capturing moments and sharing them with the world",
    "timeline": "May 2025 - Present",
    "searchDescription": "I got invited to share my journey in technology with the CPO, Vice President of Ventures Technology, and executives at RBCX",
    "longDescription": "I was honored to be the recipient of the 2023-2024 Hackergal x RBCx Innovation Scholarship. As part of this award, I had the incredible opportunity to share my story with the Chief Product Officer, Vice President of Ventures Technology, and other executives at RBC. I’m deeply grateful for the conversations and advice I received about becoming a leader in the technology space—wisdom that I’ve been actively channeling into how I approach my work today.\n\nI was also fortunate to attend a dinner hosted by RBCx, where I was surrounded by inspiring female leaders. Listening to their career journeys and how they’ve become activators of change in their respective fields was both refreshing and empowering. To say I was inspired would be an understatement."
  },
  {
    "title": "Photography",
    "alias": "more-photography",
    "headline": "Capturing moments and sharing them with the world",
    "timeline": "May 2025 - Present",
    "type": "life",
    "searchDescription": "Capturing moments and sharing them with the world",
    "longDescription": "After earning placements at both the Cohere x OpenSesame Hackathon and Meta Llama Hacks during a specific weekend in November 2024, I impulsively booked a last-minute flight to Toronto (again) for a whirlwind 72-hour stay. I must admit, programming in Toronto feels uniquely exciting. While the rest of the world was enjoying the Eras Tour, I was soaking up the energy of builders and the vibrant city I had missed :)"
  }
]
