[
  {
    "title": "Impacting Lives",
    "alias": "beaver-hangout",
    "headline": "Sharing my experiences with high school students at Beaver Hangout",
    "timeline": "May 10 2024",
    "searchDescription": "That time I got unexpectedly deep with high schoolers about life, tech, and why your career path doesn't have to be a straight line (spoiler: mine definitely wasn't)",
    "longDescription": "So there I was, thinking I'd just pop in and give a quick pep talk to some high school students at Beaver Hangout. Plot twist: it turned into one of those unexpectedly meaningful conversations that stick with you for months. As the coordinator, I found myself sharing war stories from my journey through the tech wilderness – the good, the bad, and the 'why-did-I-think-that-was-a-good-idea' moments. These kids were asking the real questions too, not just the usual 'how much money do you make' stuff. We talked about imposter syndrome (yes, it's real and yes, everyone has it), the importance of building genuine connections instead of just collecting LinkedIn contacts, and why saying 'I don't know, but let me figure it out' is actually a superpower. What hit me most was seeing these students realize that their dreams weren't too big or too weird – they just needed permission to chase them. By the end, I'm pretty sure they taught me more than I taught them. That's the thing about sharing your story: you never know whose life you might accidentally change, including your own. Walking away, I realized this wasn't just about encouraging kids to pursue tech – it was about showing them that it's okay to be curious, to take risks, and to remember that every expert was once a beginner who refused to give up."
  },
  {
    "title": "Community Engagement",
    "alias": "elevate-oregon",
    "headline": "Participating in and engaging with students at Elevate Oregon",
    "timeline": "July 3 2024",
    "searchDescription": "That time I tried to be the 'cool older student' at Elevate Oregon and ended up learning way more from the high schoolers than they did from me (classic)",
    "longDescription": "So Elevate Oregon happened, and let me tell you, walking into a room full of ambitious high school students when you're supposed to be the 'experienced' one is both terrifying and exhilarating. These kids came prepared with questions that made me go 'wait, let me think about that for a second' more times than I'd like to admit. We're talking deep stuff about career paths, dealing with failure, and how to know if you're actually cut out for tech when everyone around you seems to have it all figured out (spoiler alert: nobody does). What hit me the most was how genuine these students were about their fears and dreams. One kid asked me about handling rejection, and I found myself sharing that embarrassing story about getting turned down from my first five internship applications and crying in my car afterward. Another wanted to know if it's normal to feel like you don't belong in tech spaces – and honestly, that question hit me right in the feels because YES, it's so normal and you're definitely not alone. The coolest part wasn't me giving advice though; it was watching these students realize they weren't the only ones dealing with uncertainty and self-doubt. By the end of our session, they were giving each other advice and sharing their own experiences. I basically became the facilitator of this amazing peer-to-peer learning moment. Walking away from Elevate Oregon, I realized that sometimes the best way to help others is just to be honest about your own journey – the messy, uncertain, definitely-not-a-straight-line parts included. These students reminded me why I love what I do and why representation in tech matters so much. They're going to change the world, and I'm just grateful I got to be a tiny part of their story."
  },
  {
    "title": "Photography",
    "alias": "photography",
    "headline": "Capturing moments and sharing them with the world",
    "timeline": "May 2025 - Present",
    "searchDescription": "My attempt at becoming a nature photographer one weekend because apparently I needed another hobby (turns out trees make excellent subjects – they don't complain about posing)",
    "longDescription": "So I picked up a camera and decided I was going to be one of those people who captures the 'beauty of nature' – you know, the ones whose Instagram feeds make you question your life choices. Armed with zero professional photography experience and way too much confidence, I ventured into the great outdoors with my camera, determined to find those perfect moments that make you stop and really see the world around you. Turns out, nature photography is basically a lesson in patience disguised as a creative hobby. You spend hours waiting for the perfect light, chasing sunsets that may or may not cooperate, and having deeply philosophical conversations with trees (they're surprisingly good listeners). But there's something magical about slowing down enough to notice the way light filters through leaves, or how morning mist makes everything look like it belongs in a fantasy novel. These photos aren't going to win any awards, but they're my little love letters to the moments that made me pause and appreciate the world outside my computer screen. Some were taken during those weekend adventures when I needed to remember that there's life beyond code and deadlines. Others happened by accident when I was just walking around and suddenly thought 'wow, that's beautiful' – which, let's be honest, doesn't happen nearly enough when you're buried in tech work. Sharing these feels a bit vulnerable because they're just me trying to capture what caught my eye, but maybe that's the point. Sometimes the best photos aren't the technically perfect ones; they're the ones that remind you to look up from your phone and actually see the world around you."
  },
  {
    "title": "Photography",
    "alias": "more-photography",
    "headline": "Capturing moments and sharing them with the world",
    "timeline": "May 2025 - Present",
    "type": "life",
    "searchDescription": "More adventures in amateur nature photography where I learned that chasing golden hour light is basically a full-time job (and waterfalls photograph better than I expected)",
    "longDescription": "Apparently one weekend of nature photography wasn't enough to satisfy my newfound obsession with capturing the outdoors, so here we are with round two. This time I got a bit more ambitious – we're talking hiking trails specifically to find waterfalls, waking up at ungodly hours to catch sunrise over lakes, and yes, I became one of those people who checks the weather app obsessively for 'optimal lighting conditions.' The learning curve is real, folks. I've discovered that photographing moving water requires way more patience than photographing code (shocking, I know), and that golden hour is called that for a reason – it's literally golden and lasts about as long as my attention span during boring meetings. But there's something addictive about being out there with just your camera, trying to capture that perfect moment when nature decides to show off. Some of these shots happened during those random weekend escapes when I needed to remember that there's a whole world outside my apartment and laptop screen. Others were happy accidents – like when I was just walking around and stumbled upon a scene that made me stop and think 'okay, this is why people become photographers.' The best part? Nature doesn't care if you're having an off day or if your last three shots were terrible. It just keeps being beautiful, waiting for you to notice. Sharing these feels like showing someone your travel diary – they're personal little moments that probably mean more to me than anyone else, but maybe that's exactly why they're worth sharing. Sometimes the world needs more reminders that beautiful things exist, even if they're captured by someone who's still figuring out what all the camera buttons do."
  }
]