[
  {
    "title": "Facial Recognition Project",
    "type": "project",
    "alias": "research-project",
    "headline": "Local mathematician spirals into the world of facial recognition",
    "timeline": "Jan 2022 - Dec 2023",
    "searchDescription": "Advanced research project comparing preprocessing techniques for facial recognition systems, analyzing PCA, SVD, and KL-Expansions on 1000+ images to optimize recognition accuracy and computational efficiency",
    "longDescription": "This comprehensive research project addressed the critical challenge of improving facial recognition accuracy through advanced preprocessing techniques. The problem tackled was the inconsistent performance of facial recognition systems due to suboptimal image preprocessing methods, which significantly impacts security applications, access control systems, and automated identification processes. Using a dataset of over 1000 facial images, I implemented and compared three sophisticated mathematical approaches: Principal Component Analysis (PCA), Singular Value Decomposition (SVD), and Karhunen-Loeve Expansions (KL-Expansions). The research focused on solving the dimensionality reduction problem while preserving critical facial features. Through extensive testing of interpolation techniques including linear interpolation, cubic spline interpolation, and various resampling methods, the study revealed that cubic spline interpolation significantly outperformed other preprocessing methods in preserving facial details essential for accurate recognition. The impact of this research extends beyond academic contribution - it provides practical guidelines for enhancing facial recognition systems used in security, law enforcement, and consumer applications. The findings have direct implications for improving the reliability of biometric authentication systems, potentially reducing false positives and negatives in real-world deployments. This work contributes to the broader field of computer vision and machine learning, offering evidence-based recommendations for preprocessing pipeline optimization.",
    "tech": ["Python", "Matplotlib", "Numpy", "Scikit-learn", "Facial Recognition", "Preprocessing", "Machine Learning", "PCA", "SVD", "KL-Expansions"],
    "links": [{"link": "https://ir.library.oregonstate.edu/concern/graduate_projects/3197xw046?locale=en", "name": "check it out", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}]

  },
  {
    "title": "Machine Learning Classifier",
    "type": "project",
    "headline": "Local mathematician discovers machine learning (he thinks he's a genius)",
    "alias": "ml-classifier",
    "timeline": "Jan 2024 - Feb 2024",
    "searchDescription": "Interactive machine learning application featuring a CIFAR-10 trained classifier with Streamlit UI, enabling real-time image classification across 10 categories with visual feedback and model performance insights",
    "longDescription": "This project solved the accessibility barrier that prevents non-technical users from understanding and interacting with machine learning models. The core problem addressed was the disconnect between complex ML algorithms and user-friendly interfaces, making advanced image classification technology inaccessible to educators, students, and curious individuals wanting to explore AI capabilities. Built upon the CIFAR-10 dataset, the application classifies images into ten distinct categories: airplanes, automobiles, birds, cats, deer, dogs, frogs, horses, ships, and trucks. The solution combines a pre-trained deep learning model with an intuitive Streamlit interface, democratizing access to sophisticated image recognition technology. The impact of this project extends to educational environments where it serves as a hands-on learning tool for understanding machine learning concepts. Teachers can use it to demonstrate AI principles, while students can experiment with different images to see real-time classification results. The visual feedback system helps users understand model confidence levels and decision-making processes, bridging the gap between theoretical ML concepts and practical applications. By making machine learning tangible and interactive, this project contributes to AI literacy and helps demystify complex algorithms for broader audiences. The application also serves as a foundation for more advanced projects, showcasing how user experience design can make cutting-edge technology accessible to everyone.",
    "tech": ["Python", "Scikit-learn", "Tensorflow", "Numpy", "Streamlit", "Data Visualization"],
    "links": [{"link": "https://github.com/nanaagyei/ml-gui-app", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg" }]
  },
  {
    "title": "Tuby Media - YouTube Clone",
    "type": "project",
    "alias": "tuby-media",
    "headline": "Emerging software engineer joins the 'build an app clone' frenzy",
    "timeline": "Feb 2024 - March 2024",
    "searchDescription": "Full-featured YouTube clone application built with React and YouTube API integration, offering seamless video streaming, search functionality, and responsive design for enhanced user experience",
    "longDescription": "Tuby Media addresses the growing need for understanding large-scale video platform architecture and the technical challenges of building content delivery systems. The project tackled the complex problem of creating a responsive, fast-loading video streaming interface that can handle real-time data fetching and dynamic content rendering. Using the YouTube API, the application provides users with access to millions of videos while maintaining optimal performance and user experience. The solution demonstrates proficiency in handling API integration challenges, including rate limiting, data transformation, and error handling that are crucial for production-ready applications. The impact of this project lies in its educational value for understanding modern web development practices and video streaming technologies. It showcases how to build scalable front-end architectures that can handle large datasets and provide smooth user interactions. The responsive design ensures accessibility across devices, addressing the modern requirement for cross-platform compatibility. For aspiring developers, this project serves as a comprehensive example of integrating third-party APIs, managing state in complex applications, and implementing modern UI/UX patterns. The technical implementation provides insights into building performant React applications, optimizing API calls, and creating intuitive user interfaces that mirror industry-standard platforms. This project contributes to the broader understanding of how content platforms operate and demonstrates the technical skills necessary for building consumer-facing applications at scale.",
    "tech": ["React", "Tailwind CSS", "YouTube API"],
    "links": [{"link": "https://tuby-clone.netlify.app/", "name": "check it out", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}]
  },
  {
    "title": "OPUS Baseline Generator",
    "type": "project",
    "alias": "baseline-generator",
    "headline": "Mathematician decides to be a civil engineer for a month (he almost lost his hair)",
    "timeline": "Aug 2024 - Dec 2024",
    "searchDescription": "Intelligent GIS data processing tool utilizing K-Nearest Neighbors algorithm to generate baseline datasets for geographic areas, streamlining civil engineering and urban planning workflows",
    "longDescription": "The OPUS Baseline Generator addresses a critical inefficiency in civil engineering and urban planning: the time-consuming manual process of generating baseline data for geographic areas. This problem significantly impacts project timelines and accuracy in infrastructure development, environmental assessment, and urban planning initiatives. The solution leverages machine learning algorithms, specifically K-Nearest Neighbors, to automatically calculate spatial relationships and generate comprehensive baseline datasets from geographic coordinates. The tool transforms complex GIS data processing from a multi-day manual task into an automated, accurate process that takes minutes. The impact extends across multiple industries including construction, environmental consulting, and municipal planning. Civil engineers can now rapidly establish baseline measurements for new projects, while urban planners can quickly assess development impacts across different geographic zones. The application's ability to group and categorize geographic points based on proximity and characteristics enables more informed decision-making in infrastructure projects. By automating baseline generation, the tool reduces human error, increases consistency across projects, and allows professionals to focus on analysis rather than data preparation. The PyQt interface makes advanced GIS processing accessible to non-technical users, democratizing access to sophisticated spatial analysis tools. This project demonstrates how machine learning can solve real-world engineering challenges, providing measurable improvements in efficiency and accuracy for professionals working with geographic data. The tool's flexibility allows adaptation to various industries requiring spatial analysis, from telecommunications to environmental science.",
    "tech": ["Python", "PyQt", "K-Nearest Neighbors", "GIS Data", "Data Visualization"],
    "links": [{"link": "https://github.com/nanaagyei/baseline-update", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg"}]
  },
  {
    "title": "Wintima Foundation",
    "alias": "wintima",
    "timeline": "Jan 2025 - Present",
    "headline": "Local mathematician joins a non-profit to help the community",
    "type": "non-profit",
    "searchDescription": "Comprehensive digital transformation initiative for educational non-profit, creating modern web presence and marketing infrastructure to expand free education access in northern Ghana",
    "longDescription": "The Wintima Foundation project addresses the critical digital divide limiting educational opportunities in northern Ghana, where traditional outreach methods fail to reach underserved communities effectively. The primary problem solved was the organization's limited digital presence, which restricted their ability to attract donors, volunteers, and beneficiaries in an increasingly connected world. Through comprehensive website development and strategic digital marketing implementation, this initiative transformed how the foundation connects with stakeholders and delivers educational content. The solution encompasses a modern, responsive website built with cutting-edge technologies, strategic social media presence, and integrated fundraising capabilities that significantly expanded the foundation's reach. The impact is multifaceted: increased online visibility has led to expanded donor engagement, improved volunteer recruitment, and enhanced community awareness of available educational programs. The digital transformation enables the foundation to showcase success stories, provide transparent financial reporting, and create engaging content that resonates with both local and international supporters. By modernizing their digital infrastructure, the foundation can now efficiently manage online donations, coordinate volunteer activities, and distribute educational resources to remote communities. This project demonstrates how technology can amplify social impact, enabling non-profits to extend their mission beyond geographic limitations. The scalable architecture allows for future expansion of digital services, including online learning platforms and community engagement tools. The work contributes to the broader goal of educational equity by ensuring that quality educational resources reach underserved populations through innovative digital channels.",
    "tech": ["React", "Tailwind CSS", "Next.js", "Figma", "Framer Motion", "TypeScript", "JavaScript", "HTML", "CSS"],
    "links": [{"link": "https://github.com/Wintima/wintima.com", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg"}]
  },

  {
    "title": "Stay Afloat",
    "alias": "stay-afloat",
    "timeline": "Jan 2025 - Present",
    "headline": "Man builds a SaaS product that aims to expand online education in Ghana",
    "type": "project",
    "searchDescription": "Innovative SaaS learning management system designed specifically for Ghanaian educational institutions, featuring integrated payment processing, course management, and analytics to drive online education adoption and revenue growth",
    "longDescription": "Stay Afloat tackles the pressing challenge of limited online education infrastructure in Ghana, where traditional educational institutions struggle to adapt to digital learning demands and expand their market reach. The core problem addressed is the lack of accessible, affordable learning management systems tailored to the unique needs of African educational markets, including local payment methods, cultural considerations, and bandwidth constraints. This comprehensive SaaS platform provides educational institutions with a complete digital transformation solution, enabling them to create, manage, and monetize online courses effectively. The system integrates seamlessly with local payment processors, supports multiple languages, and offers robust analytics to help institutions understand student engagement and optimize their offerings. The impact extends beyond individual institutions to transform Ghana's educational landscape by making quality education more accessible to students across the country. Institutions using the platform report significant increases in student enrollment, improved learning outcomes through interactive features, and new revenue streams from online course offerings. The solution addresses the digital skills gap by providing institutions with user-friendly tools that require minimal technical expertise, enabling rapid adoption across different educational levels. By democratizing access to professional-grade learning management technology, Stay Afloat contributes to educational equity and economic development. The platform's scalable architecture supports growth from small community colleges to large universities, while its analytics capabilities provide valuable insights for improving educational delivery and student success rates.",
    "tech": ["React", "Tailwind CSS", "Next.js", "Figma", "Framer Motion", "TypeScript", "JavaScript", "Supabase", "Stripe"],
    "links": [{"link": "https://lms-platform-brown.vercel.app/", "name": "check it out", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}]
  },
  {
    "title": "ByDay",
    "alias": "by-day",
    "headline": "Last born of the Tuffour family joins twin brothers to build a family startup",
    "timeline": "May 2025 - Present",
    "type": "startup",
    "tech": ["React", "Tailwind CSS", "Next.js", "Supabase", "Stripe", "Google Maps API", "TypeScript"],
    "searchDescription": "Revolutionary on-demand service platform connecting skilled professionals with clients through location-based matching, real-time booking, and integrated payment systems to reduce unemployment and improve service accessibility",
    "longDescription": "ByDay addresses two critical market gaps: the difficulty clients face in finding reliable, skilled professionals for short-term projects, and the challenge skilled workers encounter in securing consistent, fairly-paid employment opportunities. The platform solves the inefficiency of traditional service discovery methods, which often rely on word-of-mouth recommendations or unreliable online directories that lack real-time availability and location-based matching. By implementing a ride-hailing model for skilled services, ByDay creates a transparent, efficient marketplace that benefits both service providers and clients. The solution leverages Google Maps integration and advanced location services to connect users with nearby professionals instantly, while robust payment processing ensures secure, cashless transactions. The platform's real-time matching algorithm considers factors like proximity, skill ratings, availability, and price preferences to optimize service delivery. The impact on unemployment reduction is significant, as the platform provides skilled workers with a steady stream of income opportunities while allowing them to maintain flexible schedules. For clients, ByDay eliminates the uncertainty and risk associated with hiring unknown service providers by implementing comprehensive rating systems, background verification, and dispute resolution mechanisms. The platform's scalable architecture supports rapid market expansion, while its data analytics provide valuable insights into service demand patterns and professional performance metrics. This entrepreneurial venture demonstrates how technology can create economic opportunities while solving real-world problems, contributing to the broader gig economy while maintaining focus on skilled professional services that require expertise and trust.",
    "links": [{"link": "https://bydayjobs.com/", "name": "check it out", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}]
  },
  {
    "title": "Akomapa Health",
    "alias": "akomapa",
    "headline": "Put 'Non-Profit' as his middle name because man be doing the most!",
    "timeline": "May 2025 - Present",
    "type": "non-profit",
    "tech": ["React", "Tailwind CSS", "Next.js", "Supabase", "Stripe", "TypeScript"],
    "searchDescription": "Comprehensive digital health education platform providing free, culturally-relevant health information and resources to underserved communities in northern Ghana, featuring multilingual content and mobile-optimized accessibility",
    "longDescription": "Akomapa Health confronts the critical public health challenge of limited access to reliable health information in northern Ghana, where geographic isolation, language barriers, and inadequate healthcare infrastructure leave communities vulnerable to preventable diseases and health complications. The primary problem addressed is the health information gap that exists between urban medical centers and rural communities, where traditional health education methods fail to reach those who need them most. As lead developer, I architected a comprehensive digital platform that delivers culturally-appropriate health education content in local languages, making vital health information accessible through mobile devices even in areas with limited internet connectivity. The solution includes features for health screening reminders, medication tracking, and emergency contact systems that connect users with healthcare providers. The platform's impact is measured through improved health literacy rates, increased preventive care adoption, and enhanced community health outcomes. By providing free, evidence-based health information in accessible formats, Akomapa Health empowers individuals to make informed decisions about their health and the health of their families. The mobile-first design ensures usability across different devices and network conditions, while the integration with local healthcare providers creates a bridge between digital health education and traditional medical services. The project's fundraising and marketing components enable sustainable operations and continuous content updates, ensuring long-term impact. This initiative demonstrates how technology can address health disparities and contribute to health equity by making quality health education universally accessible, regardless of geographic or economic barriers.",
    "links": [{"link": "https://github.com/akomapahealth/akomapa-health", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg"}]
  },
  {
    "title": "GradGPT Pro",
    "alias": "gradgptpro",
    "headline": "Local mathematician builds a SaaS product that aims to expand online education in Ghana",
    "timeline": "May 2025 - Present",
    "type": "project",
    "tech": ["Next.js", "Tailwind CSS", "Supabase", "Stripe", "OpenAI API", "Prisma", "PostgreSQL", "TypeScript"],
    "searchDescription": "Advanced AI-powered educational SaaS platform integrating OpenAI technology with comprehensive learning management features, designed to revolutionize personalized education delivery and student engagement in Ghana",
    "longDescription": "GradGPT Pro addresses the fundamental challenge of personalized education at scale, solving the problem of one-size-fits-all learning approaches that fail to accommodate diverse learning styles, paces, and educational backgrounds prevalent in Ghana's educational system. The platform leverages advanced AI technology to create adaptive learning experiences that respond to individual student needs, providing personalized tutoring, assignment assistance, and learning path optimization. By integrating OpenAI's sophisticated language models with robust educational infrastructure, the solution delivers intelligent tutoring capabilities that were previously accessible only to students with expensive private tutors. The comprehensive SaaS architecture includes features for progress tracking, automated assessment generation, intelligent content recommendations, and real-time performance analytics that help both students and educators optimize learning outcomes. The impact extends beyond individual student success to institutional transformation, as schools using GradGPT Pro report improved student engagement, reduced dropout rates, and enhanced learning efficiency. The platform's ability to provide 24/7 AI tutoring support addresses the teacher shortage crisis in many Ghanaian schools, while its multilingual capabilities ensure accessibility across diverse linguistic communities. The subscription-based model makes advanced AI education tools financially accessible to institutions that previously couldn't afford personalized learning solutions. By combining cutting-edge AI technology with deep understanding of local educational challenges, GradGPT Pro contributes to educational equity and quality improvement across Ghana's education sector. The platform's analytics provide valuable insights into learning patterns and educational effectiveness, enabling data-driven improvements to curriculum design and teaching methodologies.",
    "links": [{"link": "https://gradgpt.pro/", "name": "check it out", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}]
  }
]